tap "jesseduffield/lazygit"
brew "git"
brew "jesseduffield/lazygit/lazygit"
brew "cmake"
brew "gcc"
# brew "dive"
# brew "gitlab-runner"
# brew "k9s"
# brew "node_exporter", restart_service: true
brew "python-launcher"
brew "python@3.9"
brew "python@3.10"
brew "python@3.11"
brew "python@3.12"
brew "python@3.13"
brew "python-tk@3.9"
brew "python-tk@3.10"
brew "python-tk@3.11"
brew "python-tk@3.12"
brew "python-tk@3.13"
# brew "rustup"
