vscode "alefragnani.bookmarks"
vscode "aykutsarac.jsoncrack-vscode"
vscode "bbenoist.qml"
vscode "bierner.markdown-mermaid"
vscode "catppuccin.catppuccin-vsc"
vscode "chrisjsewell.myst-tml-syntax"
vscode "davidanson.vscode-markdownlint"
vscode "donjayamanne.githistory"
vscode "eamodio.gitlens"
vscode "emmanuelbeziat.vscode-great-icons"
vscode "firefox-devtools.vscode-firefox-debug"
vscode "github.copilot"
vscode "github.copilot-chat"
vscode "gitlab.gitlab-workflow"
vscode "google.geminicodeassist"
vscode "googlecloudtools.cloudcode"
vscode "lextudio.restructuredtext"
vscode "marcoms.oceanic-plus"
vscode "mechatroner.rainbow-csv"
vscode "ms-azuretools.vscode-docker"
vscode "ms-kubernetes-tools.vscode-kubernetes-tools"
vscode "ms-python.autopep8"
vscode "ms-python.black-formatter"
vscode "ms-python.debugpy"
vscode "ms-python.isort"
vscode "ms-python.python"
vscode "ms-python.vscode-pylance"
vscode "ms-toolsai.datawrangler"
vscode "ms-toolsai.jupyter"
vscode "ms-toolsai.jupyter-keymap"
vscode "ms-toolsai.jupyter-renderers"
vscode "ms-toolsai.vscode-jupyter-cell-tags"
vscode "ms-toolsai.vscode-jupyter-slideshow"
vscode "ms-vscode-remote.remote-containers"
vscode "ms-vscode-remote.remote-ssh"
vscode "ms-vscode-remote.remote-ssh-edit"
vscode "ms-vscode-remote.remote-wsl"
vscode "ms-vscode.cmake-tools"
vscode "ms-vscode.cpptools"
vscode "ms-vscode.cpptools-extension-pack"
vscode "ms-vscode.cpptools-themes"
vscode "ms-vscode.makefile-tools"
vscode "ms-vscode.powershell"
vscode "ms-vscode.remote-explorer"
vscode "pkief.material-icon-theme"
vscode "redhat.vscode-yaml"
vscode "ritwickdey.liveserver"
vscode "rogalmic.bash-debug"
vscode "sintrumit.theme-oceanic-next-italic"
vscode "swyddfa.esbonio"
vscode "tamasfe.even-better-toml"
vscode "tim-koehler.helm-intellisense"
vscode "tomoki1207.pdf"
vscode "tootone.org-mode"
vscode "trond-snekvik.simple-rst"
vscode "twxs.cmake"
vscode "uctakeoff.vscode-counter"
vscode "visualstudioexptteam.intellicode-api-usage-examples"
vscode "visualstudioexptteam.vscodeintellicode"
vscode "vitest.explorer"
vscode "vscode-org-mode.org-mode"