tap "homebrew/bundle"
tap "homebrew/services"
brew "bash"
brew "bat"
brew "btop"
brew "dust"
brew "eza"
brew "fastfetch"
brew "fd"
brew "fzf"
brew "inxi"
brew "jq"
brew "links"
brew "make"
brew "neovim"
# brew "newsboat"
# brew "nushell"
# brew "ranger"
brew "ripgrep"
brew "sntop"
brew "starship"
brew "stow"
brew "tldr"
brew "tmux"
brew "tree"
brew "uv"
# brew "vim"
# brew "wget"
brew "wget2"
brew "yazi"
brew "zoxide"
brew "zsh"